## SOAL 2
Disediakan sebuah dataset yang berisi daftar profesi beberapa responder, unduh: profesi.csv. Buatlah sebuah file python (.py) atau notebook (.ipynb) yang dapat menyelesaikan perintah berikut.

Ada berapa jenis profesi yang ada dalam dataset tersebut? Sebutkan!

Output yang diharapkan:

21

['technician', 'other', 'writer', 'executive', 'administrator', 'student', 'lawyer', 'educator', 'scientist', 'entertainment', 'programmer', 'librarian', 'homemaker', 'artist', 'engineer', 'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor']
Buatlah sebuah dataframe yang menunjukkan data usia maksimal, minimal & rata-ratanya, berdasarkan profesi & gender!

Output yang diharapkan:


Buatlah sebuah dataframe yang menunjukkan persentase pria & wanita tiap profesi!

In [41]:
import pandas as pd
import numpy as np

In [42]:
profDF = pd.read_csv('profesi.csv', sep='|', engine='python')
profDF

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [43]:
profDF.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# No. 1

In [44]:
profDF.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [52]:
profDF.occupation.nunique()

21

In [51]:
profOc = profDF.set_index(['occupation'])
profOc

               user_id  age gender zip_code
occupation
technician           1   24      M    85711
other                2   53      F    94043
writer               3   23      M    32067
technician           4   24      M    43537
other                5   33      F    15213
...                ...  ...    ...      ...
student            939   26      F    33319
administrator      940   32      M    02215
student            941   20      M    97229
librarian          942   48      F    78209
student            943   22      M    77841

[943 rows x 4 columns]